using System;
using System.Collections.Generic;
using System.Linq;
using System.Web;
using WCF_FMS.DAL.Model;
using WCF_FMS.TOL.PayRoll;

namespace WCF_FMS.DAL.PayRoll
{
    public class DL_Rpt12Mahe
    {
        #region Select
        public List<OBJ_Rpt12Mahe> Select(short Year, byte NobatPardakht, int OrganId,byte CalcType)
        {
            using (RasaFMSPayRollDBEntities p = new RasaFMSPayRollDBEntities())
            {
                var k = p.spr_Pay_Rpt12Mahe(Year, NobatPardakht, OrganId,Convert.ToByte(CalcType))
                    .Select(q => new OBJ_Rpt12Mahe()
                    {
                        اضافه_کاری=q.اضافه_کاری,
                        آیدی_پرسنل=q.آیدی_پرسنل,
                        بدی_آب_و_هوا=q.بدی_آب_و_هوا,
                        برجستگی=q.برجستگی,
                        بن_ماهیانه=q.بن_ماهیانه,
                        بیمه_تکمیلی_کارفرما=q.بیمه_تکمیلی_کارفرما,
                        بیمه_معاف=q.بیمه_معاف,
                        پس_انداز=q.پس_انداز,
                        تحقیقی_و_تخصصی=q.تحقیقی_و_تخصصی,
                        ترمیم_حقوق=q.ترمیم_حقوق,
                        تسهیلات_رفاهی=q.تسهیلات_رفاهی,
                        تسهیلات_زندگی=q.تسهیلات_زندگی,
                        تعطیل_کاری=q.تعطیل_کاری,
                        تعطیل_کاری_اضافه_کاری=q.تعطیل_کاری_اضافه_کاری,
                        تفاوت_بند_ی_=q.تفاوت_بند_ی_,
                        تفاوت_تطبیق=q.تفاوت_تطبیق,
                        تفاوت_تطبیق_موضوع_جزء1=q.تفاوت_تطبیق_موضوع_جزء1,
                        تفاوت_جزء_1_=q.تفاوت_جزء_1_,
                        تفاوت_ناشی_از_بند6=q.تفاوت_ناشی_از_بند6,
                        تفاوت_ناشی_از_ضریب_تعدیل=q.تفاوت_ناشی_از_ضریب_تعدیل,
                        جذب_تعدیل=q.جذب_تعدیل,
                        جذب_مشاغل_تخصصی=q.جذب_مشاغل_تخصصی,
                        مطالبات = q.مطالبات,
                        حق_اولاد=q.حق_اولاد,
                        حق_جذب_بند9=q.حق_جذب_بند9,
                        حق_جذب_تبصره_7_ماده_یک=q.حق_جذب_تبصره_7_ماده_یک,
                        حق_جذب_قضایی=q.حق_جذب_قضایی,
                        حق_شیفت=q.حق_شیفت,
                        حق_مسکن=q.حق_مسکن,
                        حقوق=q.حقوق,
                        خوار_و_بار=q.خوار_و_بار,
                        سایر_مزایا=q.سایر_مزایا,
                        سختی_کار=q.سختی_کار,
                        سنوات_پایان_خدمت=q.سنوات_پایان_خدمت,
                        ضریب_تعدیل=q.ضریب_تعدیل,
                        عائله_مندی=q.عائله_مندی,
                        فوق_العاده_ایثارگری=q.فوق_العاده_ایثارگری,
                        فوق_العاده_تعدیل=q.فوق_العاده_تعدیل,
                        فوق_العاده_تلاش=q.فوق_العاده_تلاش,
                        فوق_العاده_جذب=q.فوق_العاده_جذب,
                        فوق_العاده_خاص=q.فوق_العاده_خاص,
                        فوق_العاده_شغل=q.فوق_العاده_شغل,
                        فوق_العاده_ماده26=q.فوق_العاده_ماده26,
                        فوق_العاده_مخصوص=q.فوق_العاده_مخصوص,
                        فوق_العاده_ویژه=q.فوق_العاده_ویژه,
                        کارانه=q.کارانه,
                        کدملی=q.کدملی,
                        کل_مطالبات=q.کل_مطالبات,
                        مالیات=q.مالیات,
                        مالیات_معوقه=q.مالیات_معوقه,
                        ماموریت=q.ماموریت,
                        ماه=q.ماه,
                        مدیریتی_و_سرپرستی=q.مدیریتی_و_سرپرستی,
                        مزایای_ریالی_گروه_تشویقی=q.مزایای_ریالی_گروه_تشویقی,
                        مشمول_مالیات=q.مشمول_مالیات,
                        مشمول_مالیات_معوقه=q.مشمول_مالیات_معوقه,
                        معوقه=q.معوقه,
                        نام_پدر=q.نام_پدر,
                        نام_خانوادگی_نام=q.نام_خانوادگی_نام,
                        نوبت_کاری = q.نوبت_کاری,
                        جمع_مطالبات = q.جمع_مطالبات,
                        حق_درمان_سهم_کارفرما=q.حق_درمان_سهم_کارفرما,
                        حق_درمان_سهم_دولت=q.حق_درمان_سهم_دولت,
                        حق_درمان_سهم_دولت_معوق=q.حق_درمان_سهم_دولت_معوق,
                        حق_درمان_سهم_کارفرما_معوق=q.حق_درمان_سهم_کارفرما_معوق,
                        پس_انداز_معوق=q.پس_انداز_معوق,
                        پس_انداز_پس_انداز_معوق=q.پس_انداز_پس_انداز_معوق,
                        بیمه_تکمیلی_سهم_کارفرما=q.بیمه_تکمیلی_سهم_کارفرما,
                        بیمه_عمر_سهم_کارفرما=q.بیمه_عمر_سهم_کارفرما,
                        بیمه_سهم_کارفرما=q.بیمه_سهم_کارفرما,
                        بیمه_بیکاری=q.بیمه_بیکاری,
                        بیمه_بیکاری_معوق=q.بیمه_بیکاری_معوق,
                       بیمه_سهم_کارفرما_معوق= q.بیمه_سهم_کارفرما_معوق,
                        مزایای_جانبی_رفاهی=q.مزایای_جانبی_رفاهی,
                        هزینه_مهد_کودک=q.هزینه_مهد_کودک,
                        اقلام_خوراکی = q.اقلام_خوراکی,
                        کالاهای_بهداشتی=q.کالاهای_بهداشتی,
                        مناسبت=q.مناسبت,
                        مزایای_جوانی_جمعیت = q.مزایای_جوانی_جمعیت


                    }).ToList();
                return k;
            }
        }
        #endregion
    }
}